DataProcessors/инт_РедакторНастройкиСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>инт_РедакторНастройкиСистемы</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>инт_РазделНастроек</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.инт_РазделНастроек</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/инт_НастройкиСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>инт_НастройкиСистемы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеСтрокаНеограниченная</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеХранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>РазделНастроек</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.инт_РазделНастроек</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/инт_РедакторНастройкиСистемы/Forms/Форма/Ext/Form/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Модуль формы обработки инт_РедакторНастройкиСистемы.
// Мастер создания и изменения записей регистра сведений инт_НастройкиСистемы.
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

// Инициализация формы при создании на сервере.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РежимРаботы = "Создать";
	ТипНастройки = "Строка";
	РежимВводаХранилища = "Текст";
	ТипКорняХранилища = "Структура";
	ТипЭлементовМассива = "Строка";
	
	НастроитьВидимостьЭлементовНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Переключение полей начальной страницы при смене режима работы.
//
&НаКлиенте
Процедура РежимРаботыПриИзменении(Элемент)
	
	НастроитьВидимостьЭлементов();
	
КонецПроцедуры

// Переключение видимости полей значения при изменении типа настройки.
//
&НаКлиенте
Процедура ТипНастройкиПриИзменении(Элемент)
	
	НастроитьВидимостьЭлементов();
	
КонецПроцедуры

// Переключение режима ввода хранилища: текст или конструктор.
//
&НаКлиенте
Процедура РежимВводаХранилищаПриИзменении(Элемент)
	
	НастроитьВидимостьЭлементов();
	НастроитьДоступностьКомандКонструктора();
	НастроитьТипПоляЗначенияКонструктора();
	
КонецПроцедуры

// При выборе раздела в режиме изменения загружает существующую настройку.
//
&НаКлиенте
Процедура инт_РазделНастроекПриИзменении(Элемент)
	
	Если РежимРаботы = "Изменить" И ЗначениеЗаполнено(Объект.инт_РазделНастроек) Тогда
		
		ЗагрузитьНастройкуИзРегистра();
		НастроитьВидимостьЭлементов();
		НастроитьДоступностьКомандКонструктора();
		НастроитьТипПоляЗначенияКонструктора();
		
	КонецЕсли;
	
КонецПроцедуры

// Переключение типа корня конструктора.
//
&НаКлиенте
Процедура ТипКорняХранилищаПриИзменении(Элемент)
	
	Если ТипКорняХранилища = "Массив" И Не ЗначениеЗаполнено(ТипЭлементовМассива) Тогда
		
		ТипЭлементовМассива = "Строка";
		
	КонецЕсли;
	
	Если ТипКорняХранилища = "Массив" Тогда
		
		ПрименитьТипЭлементовКорневогоМассива();
		
	КонецЕсли;
	
	НастроитьВидимостьЭлементов();
	НастроитьДоступностьКомандКонструктора();
	НастроитьТипПоляЗначенияКонструктора();
	
КонецПроцедуры

// Смена типа элементов корневого массива.
//
&НаКлиенте
Процедура ТипЭлементовМассиваПриИзменении(Элемент)
	
	ПрименитьТипЭлементовКорневогоМассива();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЭлементыКонструктора

// Обновляет доступность команд и тип поля значения при смене текущей строки дерева.
//
&НаКлиенте
Процедура ЭлементыКонструктораПриАктивизацииСтроки(Элемент)
	
	НастроитьДоступностьКомандКонструктора();
	НастроитьТипПоляЗначенияКонструктора();
	
КонецПроцедуры

// Контроль типа, сброс значения и подбор типа поля «Значение» при смене типа строки.
//
&НаКлиенте
Процедура ЭлементыКонструктораТипЭлементаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ЭлементыКонструктора.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ОжидаемыйТип = ОжидаемыйТипЭлементаМассива(ТекущиеДанные);
	
	Если ЗначениеЗаполнено(ОжидаемыйТип) И ТекущиеДанные.ТипЭлемента <> ОжидаемыйТип Тогда
		
		ТекущиеДанные.ТипЭлемента = ОжидаемыйТип;
		ПоказатьСообщениеПользователю("В массиве допустим только один тип элементов: " + ОжидаемыйТип + ".");
		
	КонецЕсли;
	
	Если ЭтоТипКонтейнера(ТекущиеДанные.ТипЭлемента) Тогда
		
		ТекущиеДанные.ТипЭлемента = "Строка";
		ПоказатьСообщениеПользователю("Вложенные структуры, соответствия и массивы не поддерживаются. Укажите простой тип.");
		
	КонецЕсли;
	
	ТекущиеДанные.ПолучитьЭлементы().Очистить();
	ТекущиеДанные.ЗначениеПредставление = ЗначениеПоУмолчаниюТипаЭлемента(ТекущиеДанные.ТипЭлемента);
	
	НастроитьТипПоляЗначенияКонструктора();
	НастроитьДоступностьКомандКонструктора();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Переход на следующую страницу мастера.
//
&НаКлиенте
Процедура Далее(Команда)
	
	ТекСтраница = Элементы.Страницы.ТекущаяСтраница;
	
	Если ТекСтраница = Элементы.НачальнаяСтраница Тогда
		
		Если Не ЗначениеЗаполнено(РежимРаботы) Тогда
			
			ПоказатьСообщениеПользователю("Выберите действие: создать или изменить настройку.");
			Возврат;
			
		КонецЕсли;
		
		Если РежимРаботы = "Создать" Тогда
			
			Если Не ЗначениеЗаполнено(НаименованиеНовогоРаздела) Тогда
				
				ПоказатьСообщениеПользователю("Укажите наименование нового раздела настроек.");
				Возврат;
				
			КонецЕсли;
			
			НаименованиеРаздела = СокрЛП(НаименованиеНовогоРаздела);
			РазделУжеПодставлен = ЗначениеЗаполнено(Объект.инт_РазделНастроек)
				И СокрЛП(Строка(Объект.инт_РазделНастроек)) = НаименованиеРаздела;
			
			Если Не РазделУжеПодставлен Тогда
				
				РезультатСоздания = СоздатьРазделНастроекНаСервере(НаименованиеРаздела);
				
				Если Не РезультатСоздания.Успех Тогда
					
					ПоказатьСообщениеПользователю(РезультатСоздания.ОписаниеОшибки);
					Возврат;
					
				КонецЕсли;
				
				Объект.инт_РазделНастроек = РезультатСоздания.Ссылка;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаДанныхНастройки;
		
		Если РежимРаботы = "Изменить" И ЗначениеЗаполнено(Объект.инт_РазделНастроек) Тогда
			
			ЗагрузитьНастройкуИзРегистра();
			
		КонецЕсли;
		
		НастроитьВидимостьЭлементов();
		НастроитьДоступностьКомандКонструктора();
		НастроитьТипПоляЗначенияКонструктора();
		
	КонецЕсли;
	
КонецПроцедуры

// Возврат на предыдущую страницу мастера.
//
&НаКлиенте
Процедура Назад(Команда)
	
	ТекСтраница = Элементы.Страницы.ТекущаяСтраница;
	
	Если ТекСтраница = Элементы.СтраницаДанныхНастройки Тогда
		
		Элементы.Страницы.ТекущаяСтраница = Элементы.НачальнаяСтраница;
		НастроитьВидимостьЭлементов();
		
	КонецЕсли;
	
КонецПроцедуры

// Сохранение настройки в регистр сведений.
//
&НаКлиенте
Процедура Сохранить(Команда)
	
	Если Не ПроверитьЗаполнениеПередЗаписью() Тогда
		
		Возврат;
		
	КонецЕсли;
	
	РезультатЗаписи = СохранитьНастройкуНаСервере();
	
	Если РезультатЗаписи.Успех Тогда
		
		Закрыть();
		
	ИначеЕсли ЗначениеЗаполнено(РезультатЗаписи.ОписаниеОшибки) Тогда
		
		ПоказатьСообщениеПользователю(РезультатЗаписи.ОписаниеОшибки);
		
	КонецЕсли;
	
КонецПроцедуры

// Добавляет элемент в корень дерева конструктора.
//
&НаКлиенте
Процедура ДобавитьЭлементКонструктора(Команда)
	
	Если ТипКорняХранилища = "Массив" И Не ЗначениеЗаполнено(ТипЭлементовМассива) Тогда
		
		ПоказатьСообщениеПользователю("Сначала укажите тип элементов массива.");
		Возврат;
		
	КонецЕсли;
	
	Коллекция = ЭлементыКонструктора.ПолучитьЭлементы();
	НоваяСтрока = Коллекция.Добавить();
	НоваяСтрока.Ключ = "";
	НоваяСтрока.ТипЭлемента = ?(ТипКорняХранилища = "Массив", ТипЭлементовМассива, "Строка");
	НоваяСтрока.ЗначениеПредставление = ЗначениеПоУмолчаниюТипаЭлемента(НоваяСтрока.ТипЭлемента);
	
	Элементы.ЭлементыКонструктора.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
	НастроитьТипПоляЗначенияКонструктора();
	НастроитьДоступностьКомандКонструктора();
	
КонецПроцедуры

// Добавляет элемент внутрь выбранной строки (не используется — вложенность отключена).
//
&НаКлиенте
Процедура ДобавитьВложенныйЭлементКонструктора(Команда)
	
	Возврат;
	
КонецПроцедуры

// Удаляет текущую строку дерева вместе с вложенными.
//
&НаКлиенте
Процедура УдалитьЭлементКонструктора(Команда)
	
	ТекущиеДанные = Элементы.ЭлементыКонструктора.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Родитель = ТекущиеДанные.ПолучитьРодителя();
	
	Если Родитель = Неопределено Тогда
		
		Коллекция = ЭлементыКонструктора.ПолучитьЭлементы();
		
	Иначе
		
		Коллекция = Родитель.ПолучитьЭлементы();
		
	КонецЕсли;
	
	Коллекция.Удалить(Коллекция.Индекс(ТекущиеДанные));
	НастроитьДоступностьКомандКонструктора();
	
КонецПроцедуры

// Показывает справку по работе с формой редактора настроек.
//
&НаКлиенте
Процедура СправкаПоФорме(Команда)
	
	ТекстСправки =
	"Редактор настройки системы
	|
	|1. Выберите «Создать» или «Изменить», затем «Далее».
	|
	|2. «Создать»: укажите наименование нового раздела — будет создан элемент
	|   справочника «Раздел настроек», и он подставится на форме настройки.
	|   «Изменить»: выберите существующий раздел настроек.
	|
	|3. Выберите тип настройки (Строка, Длинная строка, Число, Булево, Дата,
	|   Справочник или Хранилище значений).
	|   Для справочника: сначала вид справочника, затем элемент.
	|
	|4. Хранилище значений:
	|   • Текст — вставьте результат ЗначениеВСтрокуВнутр (не JSON);
	|   • Конструктор — плоская Структура / Соответствие / Массив.
	|
	|5. Конструктор:
	|   • «Добавить» — строка с ключом, типом и значением;
	|   • типы строк — Строка, Число, Булево, Дата, Справочник, Сериализованный текст;
	|   • для справочника: сначала вид справочника, затем элемент;
	|   • вложенные структуры не создаются;
	|   • колонка «Значение» меняет тип ввода по типу строки;
	|   • для массива укажите единый «Тип элементов массива»;
	|   • ключ нужен для Структура и Соответствие.
	|
	|6. «Сохранить» записывает настройку и закрывает форму.";
	
	ПоказатьПредупреждение(, ТекстСправки);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Показывает сообщение пользователю через объект сообщения.
//
// Параметры:
//  ТекстСообщения - Строка - текст сообщения.
//
&НаКлиенте
Процедура ПоказатьСообщениеПользователю(ТекстСообщения)
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ТекстСообщения;
	Сообщение.Сообщить();
	
КонецПроцедуры

// Настраивает видимость групп полей значения (клиентский вызов серверной настройки).
//
&НаКлиенте
Процедура НастроитьВидимостьЭлементов()
	
	НастроитьВидимостьЭлементовНаСервере();
	
КонецПроцедуры

// Настраивает видимость групп полей значения и кнопок мастера.
//
&НаСервере
Процедура НастроитьВидимостьЭлементовНаСервере()
	
	ЭтоЧисло = ТипНастройки = "Число";
	ЭтоБулево = ТипНастройки = "Булево";
	ЭтоДата = ТипНастройки = "Дата";
	ЭтоСтрока = ТипНастройки = "Строка";
	ЭтоДлиннаяСтрока = ТипНастройки = "ДлиннаяСтрока";
	ЭтоСправочник = ТипНастройки = "Справочник";
	ЭтоХранилище = ТипНастройки = "Хранилище";
	ЭтоСтраницаДанных = Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаДанныхНастройки;
	ЭтоСоздание = РежимРаботы = "Создать";
	ЭтоИзменение = РежимРаботы = "Изменить";
	ЭтоНачальнаяСтраница = Не ЭтоСтраницаДанных;
	
	Элементы.НаименованиеНовогоРаздела.Видимость = ЭтоНачальнаяСтраница И ЭтоСоздание;
	Элементы.инт_РазделНастроек.Видимость = ЭтоСтраницаДанных;
	Элементы.инт_РазделНастроек.ТолькоПросмотр = ЭтоСоздание;
	Элементы.инт_РазделНастроек.АвтоОтметкаНезаполненного = ЭтоИзменение;
	
	Элементы.ГруппаЗначениеЧисло.Видимость = ЭтоЧисло;
	Элементы.ГруппаЗначениеБулево.Видимость = ЭтоБулево;
	Элементы.ГруппаЗначениеДата.Видимость = ЭтоДата;
	Элементы.ГруппаЗначениеСтрока.Видимость = ЭтоСтрока;
	Элементы.ГруппаЗначениеДлиннаяСтрока.Видимость = ЭтоДлиннаяСтрока;
	Элементы.ГруппаЗначениеСправочник.Видимость = ЭтоСправочник;
	Элементы.ГруппаХранилище.Видимость = ЭтоХранилище;
	
	Элементы.ГруппаТекстХранилища.Видимость = ЭтоХранилище И РежимВводаХранилища = "Текст";
	Элементы.ГруппаКонструкторХранилища.Видимость = ЭтоХранилище И РежимВводаХранилища = "Конструктор";
	Элементы.ТипЭлементовМассива.Видимость = ЭтоХранилище И РежимВводаХранилища = "Конструктор"
		И ТипКорняХранилища = "Массив";
	
	Элементы.Сохранить.Видимость = ЭтоСтраницаДанных;
	Элементы.Назад.Видимость = ЭтоСтраницаДанных;
	Элементы.Далее.Видимость = Не ЭтоСтраницаДанных;
	
КонецПроцедуры

// Создаёт элемент справочника инт_РазделНастроек по наименованию.
// Если раздел с таким наименованием уже есть — возвращает ошибку.
//
// Параметры:
//  НаименованиеРаздела - Строка - наименование нового раздела.
//
// Возвращаемое значение:
//  Структура:
//    * Успех - Булево - Истина при успешном создании;
//    * Ссылка - СправочникСсылка.инт_РазделНастроек, Неопределено - созданный элемент;
//    * ОписаниеОшибки - Строка - текст ошибки.
//
&НаСервереБезКонтекста
Функция СоздатьРазделНастроекНаСервере(НаименованиеРаздела)
	
	Результат = Новый Структура("Успех, Ссылка, ОписаниеОшибки", Ложь, Неопределено, "");
	
	Если Не ЗначениеЗаполнено(НаименованиеРаздела) Тогда
		
		Результат.ОписаниеОшибки = "Укажите наименование нового раздела настроек.";
		Возврат Результат;
		
	КонецЕсли;
	
	СуществующийРаздел = Справочники.инт_РазделНастроек.НайтиПоНаименованию(НаименованиеРаздела, Истина);
	
	Если ЗначениеЗаполнено(СуществующийРаздел) Тогда
		
		Результат.ОписаниеОшибки = "Раздел настроек с наименованием «" + НаименованиеРаздела
			+ "» уже существует. Выберите режим «Изменить» или укажите другое наименование.";
		Возврат Результат;
		
	КонецЕсли;
	
	СпрОбъект = Справочники.инт_РазделНастроек.СоздатьЭлемент();
	СпрОбъект.Наименование = НаименованиеРаздела;
	СпрОбъект.Записать();
	
	Результат.Успех = Истина;
	Результат.Ссылка = СпрОбъект.Ссылка;
	
	Возврат Результат;
	
КонецФункции

// Вложенные элементы отключены — конструктор работает только с плоскими коллекциями.
//
&НаКлиенте
Процедура НастроитьДоступностьКомандКонструктора()
	
	Элементы.ДобавитьВложенныйЭлементКонструктора.Доступность = Ложь;
	
КонецПроцедуры

// Подбирает ограничение типа поля «Значение» по типу текущей строки конструктора.
//
&НаКлиенте
Процедура НастроитьТипПоляЗначенияКонструктора()
	
	ТекущиеДанные = Элементы.ЭлементыКонструктора.ТекущиеДанные;
	ПолеЗначения = Элементы.ЭлементыКонструктораЗначениеПредставление;
	
	Если ТекущиеДанные = Неопределено Тогда
		
		ПолеЗначения.ОграничениеТипа = Новый ОписаниеТипов("Строка");
		ПолеЗначения.Доступность = Ложь;
		Возврат;
		
	КонецЕсли;
	
	Если ЭтоТипКонтейнера(ТекущиеДанные.ТипЭлемента) Тогда
		
		ПолеЗначения.ОграничениеТипа = Новый ОписаниеТипов("Строка");
		ПолеЗначения.Доступность = Ложь;
		Возврат;
		
	КонецЕсли;
	
	ПолеЗначения.ОграничениеТипа = ОписаниеТипаЭлементаКонструктора(ТекущиеДанные.ТипЭлемента);
	ПолеЗначения.Доступность = Истина;
	
	Если ТекущиеДанные.ТипЭлемента = "Справочник" Тогда
		
		Если ТекущиеДанные.ЗначениеПредставление <> Неопределено
			И Не ПолеЗначения.ОграничениеТипа.СодержитТип(ТипЗнч(ТекущиеДанные.ЗначениеПредставление)) Тогда
			
			ТекущиеДанные.ЗначениеПредставление = Неопределено;
			
		КонецЕсли;
		
	ИначеЕсли Не ПолеЗначения.ОграничениеТипа.СодержитТип(ТипЗнч(ТекущиеДанные.ЗначениеПредставление)) Тогда
		
		ТекущиеДанные.ЗначениеПредставление = ЗначениеПоУмолчаниюТипаЭлемента(ТекущиеДанные.ТипЭлемента);
		
	КонецЕсли;
	
КонецПроцедуры

// Возвращает описание типов для поля значения по имени типа элемента.
//
// Параметры:
//  ТипЭлемента - Строка - тип элемента конструктора.
//
// Возвращаемое значение:
//  ОписаниеТипов - допустимый тип значения.
//
&НаКлиенте
Функция ОписаниеТипаЭлементаКонструктора(ТипЭлемента)
	
	Если ТипЭлемента = "Число" Тогда
		
		Возврат Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 5));
		
	ИначеЕсли ТипЭлемента = "Булево" Тогда
		
		Возврат Новый ОписаниеТипов("Булево");
		
	ИначеЕсли ТипЭлемента = "Дата" Тогда
		
		Возврат Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Дата));
		
	ИначеЕсли ТипЭлемента = "Справочник" Тогда
		
		Возврат ОписаниеТипаВсеСсылкиСправочников();
		
	Иначе
		
		Возврат Новый ОписаниеТипов("Строка");
		
	КонецЕсли;
	
КонецФункции

// Возвращает описание типов всех ссылок справочников (доступно только на сервере).
//
// Возвращаемое значение:
//  ОписаниеТипов - тип всех ссылок справочников.
//
&НаСервереБезКонтекста
Функция ОписаниеТипаВсеСсылкиСправочников()
	
	Возврат Справочники.ТипВсеСсылки();
	
КонецФункции

// Возвращает значение по умолчанию для типа элемента конструктора.
//
// Параметры:
//  ТипЭлемента - Строка - тип элемента конструктора.
//
// Возвращаемое значение:
//  Произвольный - пустое значение соответствующего типа.
//
&НаКлиенте
Функция ЗначениеПоУмолчаниюТипаЭлемента(ТипЭлемента)
	
	Если ТипЭлемента = "Число" Тогда
		
		Возврат 0;
		
	ИначеЕсли ТипЭлемента = "Булево" Тогда
		
		Возврат Ложь;
		
	ИначеЕсли ТипЭлемента = "Дата" Тогда
		
		Возврат '00010101';
		
	ИначеЕсли ТипЭлемента = "Справочник" Тогда
		
		Возврат Неопределено;
		
	Иначе
		
		Возврат "";
		
	КонецЕсли;
	
КонецФункции

// Проверяет заполнение обязательных реквизитов перед записью.
//
// Возвращаемое значение:
//  Булево - Истина, если проверка пройдена.
//
&НаКлиенте
Функция ПроверитьЗаполнениеПередЗаписью()
	
	Если Не ЗначениеЗаполнено(Объект.инт_РазделНастроек) Тогда
		
		ПоказатьСообщениеПользователю("Укажите раздел настроек.");
		Возврат Ложь;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТипНастройки) Тогда
		
		ПоказатьСообщениеПользователю("Укажите тип настройки.");
		Возврат Ложь;
		
	КонецЕсли;
	
	Если ТипНастройки = "Хранилище" И РежимВводаХранилища = "Текст" И Не ЗначениеЗаполнено(ТекстХранилища) Тогда
		
		ПоказатьСообщениеПользователю("Введите текст в формате ЗначениеВСтрокуВнутр.");
		Возврат Ложь;
		
	КонецЕсли;
	
	Если ТипНастройки = "Хранилище" И РежимВводаХранилища = "Конструктор" Тогда
		
		Если Не ЗначениеЗаполнено(ТипКорняХранилища) Тогда
			
			ПоказатьСообщениеПользователю("Укажите тип корня хранилища.");
			Возврат Ложь;
			
		КонецЕсли;
		
		Если ЭлементыКонструктора.ПолучитьЭлементы().Количество() = 0 Тогда
			
			ПоказатьСообщениеПользователю("Добавьте хотя бы один элемент в конструктор.");
			Возврат Ложь;
			
		КонецЕсли;
		
		Если ТипКорняХранилища = "Массив" И Не ЗначениеЗаполнено(ТипЭлементовМассива) Тогда
			
			ПоказатьСообщениеПользователю("Укажите тип элементов массива.");
			Возврат Ложь;
			
		КонецЕсли;
		
		Если Не ПроверитьОднородностьМассивовКонструктора() Тогда
			
			Возврат Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Записывает настройку через API менеджера регистра.
//
// Возвращаемое значение:
//  Структура - результат ЗаписатьНастройкуСистемы (Успех, ОписаниеОшибки).
//
&НаСервере
Функция СохранитьНастройкуНаСервере()
	
	СтруктураНастройки = Новый Структура;
	СтруктураНастройки.Вставить("РазделНастроек", Объект.инт_РазделНастроек);
	СтруктураНастройки.Вставить("Значение", Неопределено);
	СтруктураНастройки.Вставить("ЗначениеСтрокаНеограниченная", "");
	СтруктураНастройки.Вставить("ЗначениеХранилище", Новый ХранилищеЗначения(Неопределено));
	
	Если ТипНастройки = "Число" Тогда
		
		СтруктураНастройки.Значение = ЗначениеЧисло;
		
	ИначеЕсли ТипНастройки = "Булево" Тогда
		
		СтруктураНастройки.Значение = ЗначениеБулево;
		
	ИначеЕсли ТипНастройки = "Дата" Тогда
		
		СтруктураНастройки.Значение = ЗначениеДата;
		
	ИначеЕсли ТипНастройки = "Строка" Тогда
		
		СтруктураНастройки.Значение = ЗначениеСтрока;
		
	ИначеЕсли ТипНастройки = "ДлиннаяСтрока" Тогда
		
		СтруктураНастройки.ЗначениеСтрокаНеограниченная = ЗначениеДлиннаяСтрока;
		
	ИначеЕсли ТипНастройки = "Справочник" Тогда
		
		СтруктураНастройки.Значение = ЗначениеСправочник;
		
	ИначеЕсли ТипНастройки = "Хранилище" Тогда
		
		СтруктураНастройки.ЗначениеХранилище = Новый ХранилищеЗначения(ПолучитьЗначениеДляХранилищаНаСервере());
		
	Иначе
		
		РезультатОшибки = Новый Структура("Успех, ОписаниеОшибки", Ложь, "Неизвестный тип настройки: " + ТипНастройки);
		Возврат РезультатОшибки;
		
	КонецЕсли;
	
	Возврат РегистрыСведений.инт_НастройкиСистемы.ЗаписатьНастройкуСистемы(СтруктураНастройки);
	
КонецФункции

// Формирует значение для помещения в хранилище значений.
//
// Возвращаемое значение:
//  Произвольный - значение из текста или конструктора.
//
&НаСервере
Функция ПолучитьЗначениеДляХранилищаНаСервере()
	
	Если РежимВводаХранилища = "Текст" Тогда
		
		Возврат ЗначениеИзСтрокиВнутр(ТекстХранилища);
		
	КонецЕсли;
	
	Возврат СобратьУзелИзКоллекции(ЭлементыКонструктора.ПолучитьЭлементы(), ТипКорняХранилища);
	
КонецФункции

// Загружает данные настройки из регистра в реквизиты формы через API менеджера.
//
&НаСервере
Процедура ЗагрузитьНастройкуИзРегистра()
	
	Если Не ЗначениеЗаполнено(Объект.инт_РазделНастроек) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ПараметрыПолучения = Новый Структура;
	ПараметрыПолучения.Вставить("РазделНастроек", Объект.инт_РазделНастроек);
	ПараметрыПолучения.Вставить("ПолучитьЗначение", Истина);
	ПараметрыПолучения.Вставить("ПолучитьЗначениеХранилище", Истина);
	ПараметрыПолучения.Вставить("ПолучитьЗначениеСтрокаНеограниченная", Истина);
	
	ДанныеНастройки = РегистрыСведений.инт_НастройкиСистемы.ПолучитьНастройкуСистемы(ПараметрыПолучения);
	
	Если ДанныеНастройки = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ОчиститьПоляЗначенийНаСервере();
	
	// Приоритет: хранилище → длинная строка → значение.
	Если ДанныеНастройки.ЗначениеХранилище <> Неопределено Тогда
		
		ТипНастройки = "Хранилище";
		РежимВводаХранилища = "Текст";
		ТекстХранилища = ЗначениеВСтрокуВнутр(ДанныеНастройки.ЗначениеХранилище);
		ЗаполнитьКонструкторИзЗначения(ДанныеНастройки.ЗначениеХранилище);
		Возврат;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеНастройки.ЗначениеСтрокаНеограниченная) Тогда
		
		ТипНастройки = "ДлиннаяСтрока";
		ЗначениеДлиннаяСтрока = ДанныеНастройки.ЗначениеСтрокаНеограниченная;
		Возврат;
		
	КонецЕсли;
	
	Если ДанныеНастройки.Значение = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ТипЗначенияРегистра = ТипЗнч(ДанныеНастройки.Значение);
	
	Если ТипЗначенияРегистра = Тип("Число") Тогда
		
		ТипНастройки = "Число";
		ЗначениеЧисло = ДанныеНастройки.Значение;
		
	ИначеЕсли ТипЗначенияРегистра = Тип("Булево") Тогда
		
		ТипНастройки = "Булево";
		ЗначениеБулево = ДанныеНастройки.Значение;
		
	ИначеЕсли ТипЗначенияРегистра = Тип("Дата") Тогда
		
		ТипНастройки = "Дата";
		ЗначениеДата = ДанныеНастройки.Значение;
		
	ИначеЕсли ТипЗначенияРегистра = Тип("Строка") Тогда
		
		ТипНастройки = "Строка";
		ЗначениеСтрока = ДанныеНастройки.Значение;
		
	ИначеЕсли ЭтоСсылкаСправочника(ДанныеНастройки.Значение) Тогда
		
		ТипНастройки = "Справочник";
		ЗначениеСправочник = ДанныеНастройки.Значение;
		
	КонецЕсли;
	
КонецПроцедуры

// Очищает реквизиты значений формы.
//
&НаСервере
Процедура ОчиститьПоляЗначенийНаСервере()
	
	ЗначениеЧисло = 0;
	ЗначениеБулево = Ложь;
	ЗначениеДата = '00010101';
	ЗначениеСтрока = "";
	ЗначениеДлиннаяСтрока = "";
	ЗначениеСправочник = Неопределено;
	ТекстХранилища = "";
	ЭлементыКонструктора.ПолучитьЭлементы().Очистить();
	
КонецПроцедуры

// Проверяет, является ли значение ссылкой на любой справочник.
//
// Параметры:
//  ПроверяемоеЗначение - Произвольный - проверяемое значение.
//
// Возвращаемое значение:
//  Булево - Истина, если тип входит в Справочники.ТипВсеСсылки().
//
&НаСервере
Функция ЭтоСсылкаСправочника(ПроверяемоеЗначение)
	
	Возврат Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(ПроверяемоеЗначение));
	
КонецФункции

// Проверяет, является ли тип контейнером для вложений.
//
// Параметры:
//  ТипЭлемента - Строка - тип элемента конструктора.
//
// Возвращаемое значение:
//  Булево - Истина для Структура, Соответствие, Массив.
//
&НаКлиенте
Функция ЭтоТипКонтейнера(ТипЭлемента)
	
	Возврат ТипЭлемента = "Структура" Или ТипЭлемента = "Соответствие" Или ТипЭлемента = "Массив";
	
КонецФункции

// Возвращает ожидаемый тип элемента, если строка находится внутри массива.
//
// Параметры:
//  СтрокаДерева - ДанныеФормыЭлементДерева - проверяемая строка.
//
// Возвращаемое значение:
//  Строка - ожидаемый тип или пустая строка.
//
&НаКлиенте
Функция ОжидаемыйТипЭлементаМассива(СтрокаДерева)
	
	Если ТипКорняХранилища = "Массив" И СтрокаДерева.ПолучитьРодителя() = Неопределено Тогда
		
		Возврат ТипЭлементовМассива;
		
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

// Устанавливает тип всех корневых элементов для корневого массива.
//
&НаКлиенте
Процедура ПрименитьТипЭлементовКорневогоМассива()
	
	Если ТипКорняХранилища <> "Массив" Или Не ЗначениеЗаполнено(ТипЭлементовМассива) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Для Каждого СтрокаДерева Из ЭлементыКонструктора.ПолучитьЭлементы() Цикл
		
		СтрокаДерева.ТипЭлемента = ТипЭлементовМассива;
		СтрокаДерева.ПолучитьЭлементы().Очистить();
		СтрокаДерева.ЗначениеПредставление = ЗначениеПоУмолчаниюТипаЭлемента(ТипЭлементовМассива);
		
	КонецЦикла;
	
	НастроитьТипПоляЗначенияКонструктора();
	
КонецПроцедуры

// Проверяет однородность типов во всех массивах дерева.
//
// Возвращаемое значение:
//  Булево - Истина, если проверка пройдена.
//
&НаКлиенте
Функция ПроверитьОднородностьМассивовКонструктора()
	
	Если ТипКорняХранилища = "Массив" Тогда
		
		Для Каждого СтрокаДерева Из ЭлементыКонструктора.ПолучитьЭлементы() Цикл
			
			Если СтрокаДерева.ТипЭлемента <> ТипЭлементовМассива Тогда
				
				ПоказатьСообщениеПользователю(
					"Все элементы корневого массива должны иметь тип «" + ТипЭлементовМассива + "».");
				Возврат Ложь;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Собирает значение узла из коллекции строк дерева.
//
// Параметры:
//  КоллекцияЭлементов - ДанныеФормыКоллекцияЭлементовДерева - элементы узла.
//  ТипУзла - Строка - Структура, Соответствие или Массив.
//
// Возвращаемое значение:
//  Произвольный - собранное значение.
//
&НаСервере
Функция СобратьУзелИзКоллекции(КоллекцияЭлементов, ТипУзла)
	
	Если ТипУзла = "Структура" Тогда
		
		Результат = Новый Структура;
		
		Для Каждого СтрокаДерева Из КоллекцияЭлементов Цикл
			
			Если Не ЗначениеЗаполнено(СтрокаДерева.Ключ) Тогда
				
				ВызватьИсключение "Для элементов структуры необходимо указать ключ.";
				
			КонецЕсли;
			
			Результат.Вставить(СтрокаДерева.Ключ, ЗначениеЭлементаКонструктора(СтрокаДерева));
			
		КонецЦикла;
		
		Возврат Результат;
		
	ИначеЕсли ТипУзла = "Соответствие" Тогда
		
		Результат = Новый Соответствие;
		
		Для Каждого СтрокаДерева Из КоллекцияЭлементов Цикл
			
			Если Не ЗначениеЗаполнено(СтрокаДерева.Ключ) Тогда
				
				ВызватьИсключение "Для элементов соответствия необходимо указать ключ.";
				
			КонецЕсли;
			
			Результат.Вставить(СтрокаДерева.Ключ, ЗначениеЭлементаКонструктора(СтрокаДерева));
			
		КонецЦикла;
		
		Возврат Результат;
		
	ИначеЕсли ТипУзла = "Массив" Тогда
		
		Результат = Новый Массив;
		
		Для Каждого СтрокаДерева Из КоллекцияЭлементов Цикл
			
			Результат.Добавить(ЗначениеЭлементаКонструктора(СтрокаДерева));
			
		КонецЦикла;
		
		Возврат Результат;
		
	Иначе
		
		ВызватьИсключение "Неизвестный тип узла конструктора: " + ТипУзла;
		
	КонецЕсли;
	
КонецФункции

// Возвращает значение одной строки дерева конструктора.
//
// Параметры:
//  СтрокаДерева - ДанныеФормыЭлементДерева - строка конструктора.
//
// Возвращаемое значение:
//  Произвольный - значение элемента.
//
&НаСервере
Функция ЗначениеЭлементаКонструктора(СтрокаДерева)
	
	Если СтрокаДерева.ТипЭлемента = "Строка" Тогда
		
		Возврат Строка(СтрокаДерева.ЗначениеПредставление);
		
	ИначеЕсли СтрокаДерева.ТипЭлемента = "Число" Тогда
		
		Возврат Число(СтрокаДерева.ЗначениеПредставление);
		
	ИначеЕсли СтрокаДерева.ТипЭлемента = "Булево" Тогда
		
		Если ТипЗнч(СтрокаДерева.ЗначениеПредставление) = Тип("Булево") Тогда
			
			Возврат СтрокаДерева.ЗначениеПредставление;
			
		КонецЕсли;
		
		Нормализованное = ВРег(СокрЛП(Строка(СтрокаДерева.ЗначениеПредставление)));
		Возврат Нормализованное = "ИСТИНА" Или Нормализованное = "ДА" Или Нормализованное = "1"
			Или Нормализованное = "TRUE";
		
	ИначеЕсли СтрокаДерева.ТипЭлемента = "Дата" Тогда
		
		Если ТипЗнч(СтрокаДерева.ЗначениеПредставление) = Тип("Дата") Тогда
			
			Возврат СтрокаДерева.ЗначениеПредставление;
			
		КонецЕсли;
		
		Возврат XMLЗначение(Тип("Дата"), Строка(СтрокаДерева.ЗначениеПредставление));
		
	ИначеЕсли СтрокаДерева.ТипЭлемента = "Справочник" Тогда
		
		Возврат СтрокаДерева.ЗначениеПредставление;
		
	ИначеЕсли СтрокаДерева.ТипЭлемента = "СериализованныйТекст" Тогда
		
		Возврат ЗначениеИзСтрокиВнутр(Строка(СтрокаДерева.ЗначениеПредставление));
		
	Иначе
		
		ВызватьИсключение "Неизвестный тип элемента конструктора: " + СтрокаДерева.ТипЭлемента;
		
	КонецЕсли;
	
КонецФункции

// Заполняет дерево конструктора из значения хранилища.
//
// Параметры:
//  ЗначениеХранилища - Произвольный - значение, извлеченное из хранилища.
//
&НаСервере
Процедура ЗаполнитьКонструкторИзЗначения(ЗначениеХранилища)
	
	КоллекцияКорня = ЭлементыКонструктора.ПолучитьЭлементы();
	КоллекцияКорня.Очистить();
	
	ТипЗначения = ТипЗнч(ЗначениеХранилища);
	
	Если ТипЗначения = Тип("Структура") Тогда
		
		ТипКорняХранилища = "Структура";
		ЗаполнитьКоллекциюИзСтруктуры(КоллекцияКорня, ЗначениеХранилища);
		
	ИначеЕсли ТипЗначения = Тип("Соответствие") Тогда
		
		ТипКорняХранилища = "Соответствие";
		ЗаполнитьКоллекциюИзСоответствия(КоллекцияКорня, ЗначениеХранилища);
		
	ИначеЕсли ТипЗначения = Тип("Массив") Тогда
		
		ТипКорняХранилища = "Массив";
		ТипЭлементовМассива = ОпределитьТипЭлементовПоМассивуЗначений(ЗначениеХранилища);
		ЗаполнитьКоллекциюИзМассива(КоллекцияКорня, ЗначениеХранилища);
		
	Иначе
		
		ТипКорняХранилища = "Структура";
		НоваяСтрока = КоллекцияКорня.Добавить();
		НоваяСтрока.Ключ = "Значение";
		НоваяСтрока.ТипЭлемента = "СериализованныйТекст";
		НоваяСтрока.ЗначениеПредставление = ЗначениеВСтрокуВнутр(ЗначениеХранилища);
		
	КонецЕсли;
	
КонецПроцедуры

// Определяет тип элементов массива по первому элементу.
//
// Параметры:
//  МассивЗначения - Массив - исходный массив.
//
// Возвращаемое значение:
//  Строка - имя типа элемента конструктора.
//
&НаСервере
Функция ОпределитьТипЭлементовПоМассивуЗначений(МассивЗначения)
	
	Если МассивЗначения.Количество() = 0 Тогда
		
		Возврат "Строка";
		
	КонецЕсли;
	
	ТипЗначения = ТипЗнч(МассивЗначения[0]);
	
	Если ТипЗначения = Тип("Строка") Тогда
		
		Возврат "Строка";
		
	ИначеЕсли ТипЗначения = Тип("Число") Тогда
		
		Возврат "Число";
		
	ИначеЕсли ТипЗначения = Тип("Булево") Тогда
		
		Возврат "Булево";
		
	ИначеЕсли ТипЗначения = Тип("Дата") Тогда
		
		Возврат "Дата";
		
	ИначеЕсли ЭтоСсылкаСправочника(МассивЗначения[0]) Тогда
		
		Возврат "Справочник";
		
	Иначе
		
		Возврат "СериализованныйТекст";
		
	КонецЕсли;
	
КонецФункции

// Заполняет коллекцию дерева из структуры.
//
// Параметры:
//  КоллекцияЭлементов - ДанныеФормыКоллекцияЭлементовДерева - коллекция узлов.
//  СтруктураЗначения - Структура - исходная структура.
//
&НаСервере
Процедура ЗаполнитьКоллекциюИзСтруктуры(КоллекцияЭлементов, СтруктураЗначения)
	
	Для Каждого КлючИЗначение Из СтруктураЗначения Цикл
		
		ДобавитьУзелКонструктораИзЗначения(КоллекцияЭлементов, КлючИЗначение.Ключ, КлючИЗначение.Значение);
		
	КонецЦикла;
	
КонецПроцедуры

// Заполняет коллекцию дерева из соответствия.
//
// Параметры:
//  КоллекцияЭлементов - ДанныеФормыКоллекцияЭлементовДерева - коллекция узлов.
//  СоответствиеЗначения - Соответствие - исходное соответствие.
//
&НаСервере
Процедура ЗаполнитьКоллекциюИзСоответствия(КоллекцияЭлементов, СоответствиеЗначения)
	
	Для Каждого КлючИЗначение Из СоответствиеЗначения Цикл
		
		ДобавитьУзелКонструктораИзЗначения(КоллекцияЭлементов, Строка(КлючИЗначение.Ключ), КлючИЗначение.Значение);
		
	КонецЦикла;
	
КонецПроцедуры

// Заполняет коллекцию дерева из массива.
//
// Параметры:
//  КоллекцияЭлементов - ДанныеФормыКоллекцияЭлементовДерева - коллекция узлов.
//  МассивЗначения - Массив - исходный массив.
//
&НаСервере
Процедура ЗаполнитьКоллекциюИзМассива(КоллекцияЭлементов, МассивЗначения)
	
	Для Каждого ЭлементМассива Из МассивЗначения Цикл
		
		ДобавитьУзелКонструктораИзЗначения(КоллекцияЭлементов, "", ЭлементМассива);
		
	КонецЦикла;
	
КонецПроцедуры

// Добавляет узел дерева на основании произвольного значения.
//
// Параметры:
//  КоллекцияЭлементов - ДанныеФормыКоллекцияЭлементовДерева - коллекция узлов.
//  Ключ - Строка - ключ элемента.
//  ЗначениеЭлемента - Произвольный - значение элемента.
//
&НаСервере
Процедура ДобавитьУзелКонструктораИзЗначения(КоллекцияЭлементов, Ключ, ЗначениеЭлемента)
	
	НоваяСтрока = КоллекцияЭлементов.Добавить();
	НоваяСтрока.Ключ = Ключ;
	
	ТипЗначения = ТипЗнч(ЗначениеЭлемента);
	
	Если ТипЗначения = Тип("Строка") Тогда
		
		НоваяСтрока.ТипЭлемента = "Строка";
		НоваяСтрока.ЗначениеПредставление = ЗначениеЭлемента;
		
	ИначеЕсли ТипЗначения = Тип("Число") Тогда
		
		НоваяСтрока.ТипЭлемента = "Число";
		НоваяСтрока.ЗначениеПредставление = ЗначениеЭлемента;
		
	ИначеЕсли ТипЗначения = Тип("Булево") Тогда
		
		НоваяСтрока.ТипЭлемента = "Булево";
		НоваяСтрока.ЗначениеПредставление = ЗначениеЭлемента;
		
	ИначеЕсли ТипЗначения = Тип("Дата") Тогда
		
		НоваяСтрока.ТипЭлемента = "Дата";
		НоваяСтрока.ЗначениеПредставление = ЗначениеЭлемента;
		
	ИначеЕсли ЭтоСсылкаСправочника(ЗначениеЭлемента) Тогда
		
		НоваяСтрока.ТипЭлемента = "Справочник";
		НоваяСтрока.ЗначениеПредставление = ЗначениеЭлемента;
		
	ИначеЕсли ТипЗначения = Тип("Структура") Тогда
		
		НоваяСтрока.ТипЭлемента = "СериализованныйТекст";
		НоваяСтрока.ЗначениеПредставление = ЗначениеВСтрокуВнутр(ЗначениеЭлемента);
		
	ИначеЕсли ТипЗначения = Тип("Соответствие") Тогда
		
		НоваяСтрока.ТипЭлемента = "СериализованныйТекст";
		НоваяСтрока.ЗначениеПредставление = ЗначениеВСтрокуВнутр(ЗначениеЭлемента);
		
	ИначеЕсли ТипЗначения = Тип("Массив") Тогда
		
		НоваяСтрока.ТипЭлемента = "СериализованныйТекст";
		НоваяСтрока.ЗначениеПредставление = ЗначениеВСтрокуВнутр(ЗначениеЭлемента);
		
	Иначе
		
		НоваяСтрока.ТипЭлемента = "СериализованныйТекст";
		НоваяСтрока.ЗначениеПредставление = ЗначениеВСтрокуВнутр(ЗначениеЭлемента);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
